#!/bin/sh

DATABASE=db1u33
USERNAME=db1u33
HOSTNAME=hostname
export PGPASSWORD=PQGBWj2C

psql -h $HOSTNAME -U $USERNAME $DATABASE -c "SELECT μέση_υγρασία,μέση_ταχύτητα_ανέμου,διεύθυνση_ανέμου,μέση_θερμοκρασία
FROM Μετεωρολογικά_Δεδομένα,Καταγραφή,Σταθμός_Αναφοράς,Μετεωρολογικοί_Σταθμοί,Δήμοι
WHERE Μετεωρολογικά_Δεδομένα.mid=Καταγραφή.mid
AND  Καταγραφή.sid=Μετεωρολογικοί_Σταθμοί.sid
AND  Μετεωρολογικοί_Σταθμοί.sid=Σταθμός_Αναφοράς.sid
AND  Σταθμός_Αναφοράς.pid=Δήμοι.pid
AND ημερομηνία='2010-01-22'
AND όνομα_περιφέρειας='ΠΕΡΙΦΈΡΕΙΑ ΑΤΤΙΚΉΣ';";
